PAnel DAta(PANDAs)
> 데이터 분석 및 조작 목적 라이브러리

In [2]:
import pandas as pd

1차원 데이터와 2차원 데이터로 나누어져있음
- 1차원데이터(Series) : 인덱스와 값만
- 2차원데이터(Data Frame) : 표와 같은 데이터

In [4]:
# Series
# 인덱스 지정 시 index=[]로 데이터 개수와 동일하게 삽입

population = pd.Series([9904312, 3448737, 2890451, 2466052], index = ['서울', '부산', '인천', '대구'])
print(population,type(population))

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64 <class 'pandas.core.series.Series'>

In [5]:
# Series의 값 확인
print(population.values)

# Series의 index 확인
print(population.index)

# Series의 타입 확인
print(population.dtype)

[9904312 3448737 2890451 2466052]
Index(['서울', '부산', '인천', '대구'], dtype='object')
int64

In [6]:
# Series에 이름 지정
population.name = '인구'
population.index.name = '도시'

print(population)

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [7]:
# Series 연산
print(population/1000)

도시
서울    9904.312
부산    3448.737
인천    2890.451
대구    2466.052
Name: 인구, dtype: float64

In [14]:
# Series 인덱싱
print(population[0])
print(population[-1])
print(population['서울'])
print(population['대구'])

# 멀티 인덱싱
print(population[[0,3,1]])
print(population[['서울','인천']])

9904312
2466052
9904312
2466052
도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64
도시
서울    9904312
인천    2890451
Name: 인구, dtype: int64

In [17]:
# Series boolean인덱싱

print(population > 2500000)

도시
서울     True
부산     True
인천     True
대구    False
Name: 인구, dtype: bool

In [18]:
population[(population>2500000) & (population<5000000)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [22]:
# Series 슬라이싱

print(population[1:3])
print(population[1:])
print(population[:3])
print(population[:])

# 인덱스 명으로 슬라이싱

print(population['부산':'대구'])

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64
도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64
도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64
도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64
도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [23]:
# Series 생성법 - 2

data = {
    '서울' : 9631482,
    '부산' : 3393191,
    '인천' : 2632035,
    '대전' : 1490158,
}

population_2 = pd.Series(data)
print(population_2)

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [25]:
po = population - population_2
print(po)

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [27]:
print(po.notnull())
print(po.isnull())

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool
대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [28]:
print(po[po.notnull()])
print(po[po.isnull()])

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64
대구   NaN
대전   NaN
dtype: float64

##### dataframe

In [30]:
#dataframe 생성

data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
}

df = pd.DataFrame(data)
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [31]:
df.index = ['서울', '부산', '인천', '대구']
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [40]:
# dataframe 생성 - 2

data = [[9904312, 3448737, 2890451, 2466052],[9631482, 3393191, 2632035, 2431774]]
data_index = ['2015', '2010']
column = ['서울', '부산', '인천', '대구']

df2 = pd.DataFrame(data, index = data_index, columns = column)
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [41]:
# 행-열 전환

df2.T

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [43]:
# dataframe의 값 확인
print(df.values)

# dataframe의 인덱스 확인
print(df.index)

# dataframe의 컬럼 확인
print(df.columns)

[[9904312 9631482]
 [3448737 3393191]
 [2890451 2632035]
 [2466052 2431774]]
Index(['서울', '부산', '인천', '대구'], dtype='object')
Index(['2015', '2010'], dtype='object')

In [45]:
# dataframe의 열 인덱싱
print(df['2015'])      # Series형태로 출력됨
print(df[['2015']])    # dataframe형태로 출력됨

print(df[['2010','2015']])  # 복수의 열 선택 가능

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64
       2015
서울  9904312
부산  3448737
인천  2890451
대구  2466052
       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [46]:
# dataframe에 새로운 열 추가
df['2005'] = [9762546, 3512547, 2517680, 2456016]
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [52]:
# dataframe의 행 인덱싱
print(df[0:1]) #0행0열
print(df[:2])
print(df[1:])
print(df[:])

print(df['서울':'인천'])

       2015     2010     2005
서울  9904312  9631482  9762546
       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
       2015     2010     2005
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016
       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016
       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

In [59]:
# 인덱서
# loc[], iloc[] ([행:행,열:열])
# 컴마를 기준으로 행과 열을 가져옴
# loc 실제 인덱스를 사용해서 행을 가져 올 때 사용
print(df.loc['서울':'인천'])
print(df.loc['서울':'인천','2015':'2005'])
print(df.loc['서울','2015'])
print(df.iloc[1,0]) # 1행 0열에 있는 데이터

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
9904312
3448737

In [62]:
# iloc[]에는 인덱스 번호로 출력
print(df.iloc[1:]) # 1행~
print(df.iloc[3]) # 3행의 데이터를 반전된 형식으로 보여줌
print(df.iloc[1:,:]) # 1행~, 모든열

       2015     2010     2005
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016
2015    2466052
2010    2431774
2005    2456016
Name: 대구, dtype: int64
       2015     2010     2005
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [65]:
# dataframe boolean인덱싱(True인 것들만 보여줌)

print(df['2010'] >= 2500000)
print(df[df['2010'] >= 2500000])

서울     True
부산     True
인천     True
대구    False
Name: 2010, dtype: bool
       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

#### Data 불러와서 활용

##### 1

In [69]:
pop_num = pd.read_csv('data/population_number.csv', encoding='euc-kr', index_col='도시')
pop_num

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [70]:
# 중복된 값이 나온 횟수를 세주는 함수

pop_num['2015'].value_counts()

9904312    1
3448737    1
2890451    1
2466052    1
Name: 2015, dtype: int64

In [72]:
# 중복 함수 활용
import numpy as np

# 0~5 숫자를 무작위로 100개 넣어 중복된 값 탐색
value_text = pd.Series(np.random.randint(6, size=100))
value_text.value_counts()

3    22
4    20
5    19
0    16
2    15
1     8
dtype: int64

In [74]:
# 값 정렬 - 인덱스 값 기준, 데이터 기준

# sort_index() - 인덱스 기준
# sort_values() - 데이터 기준

print(pop_num['2015'].sort_index())   # index기준으로 오름차순
print(pop_num['2015'].sort_values())   # 데이터 기준으로 오름차순
# sort_values(ascending = False)은 내림차순, True(오름차순)가 디폴트

도시
대구    2466052
부산    3448737
서울    9904312
인천    2890451
Name: 2015, dtype: int64
도시
대구    2466052
인천    2890451
부산    3448737
서울    9904312
Name: 2015, dtype: int64

In [75]:
# 2010년도 인구 수 기준으로 오름차순 정렬

pop_num.sort_values(by = '2010')

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437

##### 2

In [76]:
score = pd.read_csv('data/score.csv',encoding = 'euc-kr', index_col = '과목')
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [80]:
# sum()
# score.sum() -> 열 기준으로 더해짐

score.sum().sort_values(ascending = False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [82]:
# sum(axis = 1) - 행의 합

# score.sum(axis = 1)
score.sum(axis = 1).sort_values()

과목
과학    163
수학    201
국어    253
영어    282
사회    298
dtype: int64

In [83]:
score['합계'] = score.sum(axis = 1)
score

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

In [84]:
del score['합계']
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [99]:
# 열 추가

score['평균'] = score.mean(axis = 1)
score

    1반  2반  3반  4반     평균
과목
수학  45  44  73  39  50.25
영어  76  92  45  69  70.50
국어  47  92  45  69  63.25
사회  92  81  85  40  74.50
과학  11  79  47  26  40.75

In [100]:
# 행 추가
score.loc['반평균'] = score.mean()
score

       1반    2반    3반    4반     평균
과목
수학   45.0  44.0  73.0  39.0  50.25
영어   76.0  92.0  45.0  69.0  70.50
국어   47.0  92.0  45.0  69.0  63.25
사회   92.0  81.0  85.0  40.0  74.50
과학   11.0  79.0  47.0  26.0  40.75
반평균  54.2  77.6  59.0  48.6  59.85

In [104]:
# 과목 별 가장 큰 값, 작은 값

print(score.max(axis = 1))
print(score.min(axis = 1))

# 반 별 가장 큰 값, 작은 값
print(score.max())
print(score.min())

과목
수학     73.0
영어     92.0
국어     92.0
사회     92.0
과학     79.0
반평균    77.6
dtype: float64
과목
수학     39.0
영어     45.0
국어     45.0
사회     40.0
과학     11.0
반평균    48.6
dtype: float64
1반    92.0
2반    92.0
3반    85.0
4반    69.0
평균    74.5
dtype: float64
1반    11.00
2반    44.00
3반    45.00
4반    26.00
평균    40.75
dtype: float64

In [105]:
score.loc[:'과학',:'4반'].max(axis = 1)

과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64

##### 3

In [107]:
data_dic = {
    'A': [1, 3, 3, 4, 4],
    'B': [1, 2, 2, 3, 3],
    'C': [1, 2, 4, 4, 5],
}

df3 = pd.DataFrame(data_dic)
df3

   A  B  C
0  1  1  1
1  3  2  2
2  3  2  4
3  4  3  4
4  4  3  5

In [108]:
# apply함수 : 행렬에 관련된 함수 적용하고 싶을 때 사용

df4 = df3.apply(pd.value_counts)
df4

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [109]:
# NaN값 0으로 채우기

df4.fillna(value = 0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [110]:
df5 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df6 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df7 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [113]:
# 데이터 병합

result = pd.concat([df5, df6, df7])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11